app/controllers/students_controller.rb

    def create
        #byebug
        @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Maggie"], ["last_name", "Mata"], ["created_at", "2020-09-21 21:02:11.327939"], ["updated_at", "2020-09-21 21:02:11.327939"]]

    def update
        @student = Student.find(params[:id])
        @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Gallabro"], ["updated_at", "2020-09-21 22:24:05.188428"], ["id", 5]]